
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>PPML · CNCC-sig</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="CNCC-sig.cn">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-emphasize/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tags/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-hints/plugin-hints.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="cczoo.html" />
    
    
    <link rel="prev" href="java_enclave.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="java_enclave.html">
            
                <a href="java_enclave.html">
            
                    
                    JavaEnclave
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="ppml.html">
            
                <a href="ppml.html">
            
                    
                    PPML
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="cczoo.html">
            
                <a href="cczoo.html">
            
                    
                    CCZoo
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="vsgx.html">
            
                <a href="vsgx.html">
            
                    
                    vSGX
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="sgx_and_dcap.html">
            
                <a href="sgx_and_dcap.html">
            
                    
                    SGX SDK & DCAP
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="occlum.html">
            
                <a href="occlum.html">
            
                    
                    Occlum
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="inclavare_containers.html">
            
                <a href="inclavare_containers.html">
            
                    
                    Inclavare Containers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="enclave_cc.html">
            
                <a href="enclave_cc.html">
            
                    
                    Enclave-CC
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="rats_tls.html">
            
                <a href="rats_tls.html">
            
                    
                    RATS-TLS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="amd_sev.html">
            
                <a href="amd_sev.html">
            
                    
                    AMD SEV
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="hygon_csv.html">
            
                <a href="hygon_csv.html">
            
                    
                    海光CSV机密容器
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >PPML</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="ppml">PPML</h1>
<h2 id="&#x9879;&#x76EE;&#x4F4D;&#x7F6E;&#x94FE;&#x63A5;">&#x9879;&#x76EE;&#x4F4D;&#x7F6E;&#x94FE;&#x63A5;</h2>
<p><a href="https://github.com/intel-analytics/BigDL" target="_blank">https://github.com/intel-analytics/BigDL</a></p>
<p><a href="https://github.com/intel-analytics/BigDL/tree/main/ppml" target="_blank">https://github.com/intel-analytics/BigDL/tree/main/ppml</a></p>
<h2 id="&#x5F52;&#x5C5E;&#x793E;&#x533A;sig">&#x5F52;&#x5C5E;&#x793E;&#x533A;SIG</h2>
<p>&#x4E91;&#x539F;&#x751F;&#x673A;&#x5BC6;&#x8BA1;&#x7B97;SIG</p>
<h2 id="&#x6280;&#x672F;&#x81EA;&#x8EAB;&#x4ECB;&#x7ECD;">&#x6280;&#x672F;&#x81EA;&#x8EAB;&#x4ECB;&#x7ECD;</h2>
<h3 id="&#x9886;&#x57DF;&#x7684;&#x95EE;&#x9898;&#x548C;&#x6311;&#x6218;">&#x9886;&#x57DF;&#x7684;&#x95EE;&#x9898;&#x548C;&#x6311;&#x6218;</h3>
<p>&#x5728;&#x4F17;&#x591A;&#x8BA1;&#x7B97;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x5927;&#x6570;&#x636E;&#x5206;&#x6790;&#x548C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x5173;&#x952E;&#x73AF;&#x8282;&#x3002;&#x603B;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x6570;&#x636E;&#x8D8A;&#x591A;&#xFF0C;&#x6570;&#x636E;&#x5206;&#x6790;&#x7684;&#x4EF7;&#x503C;&#x8D8A;&#x5927;&#xFF0C;ML/DL&#x7684;&#x6A21;&#x578B;&#x4E5F;&#x4F1A;&#x8D8A;&#x5B8C;&#x5584;&#x3002;&#x4F46;&#x56E4;&#x79EF;&#x548C;&#x5904;&#x7406;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x9690;&#x79C1;&#x3001;&#x5B89;&#x5168;&#x548C;&#x76D1;&#x7BA1;&#x7B49;&#x98CE;&#x9669;&#x3002;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF08;PPML&#xFF0C;&#x5305;&#x542B;&#x5927;&#x6570;&#x636E;&#x5206;&#x6790;&#x548C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF09;&#x6709;&#x52A9;&#x4E8E;&#x5316;&#x89E3;&#x8FD9;&#x4E9B;&#x98CE;&#x9669;&#xFF0C;&#x80FD;&#x591F;&#x5728;&#x4E0D;&#x900F;&#x9732;&#x539F;&#x59CB;&#x6570;&#x636E;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x7684;&#x6709;&#x6548;&#x6D41;&#x52A8;&#xFF0C;&#x8BA9;&#x4F7F;&#x7528;&#x65B9;&#x5229;&#x7528;&#x6570;&#x636E;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<h3 id="&#x5BF9;&#x6311;&#x6218;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;bigdl-ppml">&#x5BF9;&#x6311;&#x6218;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;BigDL PPML</h3>
<p>&#x82F1;&#x7279;&#x5C14;&#x7B2C;&#x4E09;&#x4EE3;&#x81F3;&#x5F3A;&#x53EF;&#x6269;&#x5C55;&#x5904;&#x7406;&#x5668;&#x4E3A;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x4FE1;&#x786C;&#x4EF6;&#x6267;&#x884C;&#x73AF;&#x5883; - &#x8F6F;&#x4EF6;&#x9632;&#x62A4;&#x6269;&#x5C55;&#xFF08;&#x82F1;&#x7279;&#x5C14;&#xAE; SGX&#xFF09;&#x3002;&#x82F1;&#x7279;&#x5C14;&#x57FA;&#x4E8E;SGX&#x6253;&#x9020;&#x4E86;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5927;&#x6570;&#x636E;&#x548C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x9690;&#x79C1;&#x8BA1;&#x7B97;&#x89E3;&#x51B3;&#x65B9;&#x6848;BigDL PPML&#x3002;</p>
<p>BigDL&#x662F;&#x82F1;&#x7279;&#x5C14;&#x5F00;&#x6E90;&#x7684;&#x7EDF;&#x4E00;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5E73;&#x53F0;&#xFF0C;&#x6570;&#x636E;&#x79D1;&#x5B66;&#x5BB6;&#xFF0C;&#x6570;&#x636E;&#x5DE5;&#x7A0B;&#x5E08;&#x7B49;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;BigDL&#x8F7B;&#x677E;&#x521B;&#x5EFA;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5E94;&#x7528;&#x3002;BigDL&#x5E94;&#x7528;&#x82F1;&#x7279;&#x5C14;SGX&#x53EF;&#x4FE1;&#x786C;&#x4EF6;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF08;Trusted Execution Environment, TEE&#xFF09;&#xFF0C;&#x5E76;&#x96C6;&#x6210;&#x4E86;&#x5176;&#x4ED6;&#x8F6F;&#x786C;&#x4EF6;&#x5B89;&#x5168;&#x63AA;&#x65BD;&#xFF0C;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF08;Privacy Preserving Machine Learning, PPML&#xFF09;&#x5E73;&#x53F0;&#xFF0C;&#x80FD;&#x591F;&#x4FDD;&#x62A4;&#x7AEF;&#x5230;&#x7AEF;&#xFF08;&#x5305;&#x62EC;&#x6570;&#x636E;&#x8F93;&#x5165;&#xFF0C;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B49;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#xFF09;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5E94;&#x7528;&#x3002;</p>
<h3 id="&#x6280;&#x672F;&#x4ECB;&#x7ECD;&#x56FE;&#x7247;">&#x6280;&#x672F;&#x4ECB;&#x7ECD;&#x56FE;&#x7247;</h3>
<p><img src="materials/imgs/ppml_architecture.png" alt="image.png"></p>
<p><img src="materials/imgs/ppml_workflow.png" alt="image.png"></p>
<p>&#x4E0A;&#x56FE;&#x662F;BigDL PPML&#x9884;&#x5236;&#x5DE5;&#x4F5C;&#x6D41;&#xFF1A;</p>
<ol>
<li>&#x7528;&#x6237;&#x901A;&#x8FC7;BigDL PPML&#x547D;&#x4EE4;&#x884C;&#x5411;Kubernetes&#x63D0;&#x4EA4;&#x4EFB;&#x52A1;&#xFF0C;&#x6B64;&#x64CD;&#x4F5C;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x9A71;&#x52A8;&#x8282;&#x70B9;</li>
<li>BigDL PPML&#x5BA2;&#x6237;&#x7AEF;&#x8BA4;&#x8BC1;&#x9A71;&#x52A8;&#x8282;&#x70B9;</li>
<li>&#x9A71;&#x52A8;&#x8282;&#x70B9;&#x521B;&#x5EFA;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x8282;&#x70B9;</li>
<li>&#x9A71;&#x52A8;&#x8282;&#x70B9;&#x8BA4;&#x8BC1;&#x5DE5;&#x4F5C;&#x8282;&#x70B9;</li>
<li>&#x9A71;&#x52A8;&#x8282;&#x70B9;&#x548C;&#x5DE5;&#x4F5C;&#x8282;&#x70B9;&#x4ECE;&#x5BC6;&#x94A5;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#x83B7;&#x53D6;&#x5BC6;&#x94A5;</li>
<li>&#x5DE5;&#x4F5C;&#x8282;&#x70B9;&#x8BFB;&#x53D6;&#x8F93;&#x5165;&#x6570;&#x636E;&#x5E76;&#x89E3;&#x5BC6;</li>
<li>&#x5DE5;&#x4F5C;&#x8282;&#x70B9;&#x5206;&#x5E03;&#x5F0F;&#x8FD0;&#x884C;&#x5927;&#x6570;&#x636E;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6216;&#x8005;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;</li>
</ol>
<h2 id="&#x5E94;&#x7528;&#x573A;&#x666F;">&#x5E94;&#x7528;&#x573A;&#x666F;</h2>
<h3 id="&#x573A;&#x666F;&#x63CF;&#x8FF0;">&#x573A;&#x666F;&#x63CF;&#x8FF0;</h3>
<p>1&#x3001;&#x5728;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#x4E0A;&#x5F00;&#x53D1;&#x5E76;&#x8FD0;&#x884C;&#x6807;&#x51C6;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5E94;&#x7528;&#xFF08;&#x5982;&#x5927;&#x6570;&#x636E;&#x5206;&#x6790;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3001;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B49;&#xFF09;&#x3002;</p>
<p>2&#x3001;&#x5229;&#x7528;&#x57FA;&#x4E8E;&#x786C;&#x4EF6;&#x7684;&#x5B89;&#x5168;&#x6280;&#x672F;&#x6280;&#x672F;&#xFF08;&#x5982;&#x82F1;&#x7279;&#x5C14;&#xAE;SGX&#xFF09;&#x4FDD;&#x62A4;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x6570;&#x636E;&#x3002;</p>
<p>3&#x3001;&#x4E3A;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x5177;&#x5907;&#x82F1;&#x7279;&#x5C14;&#xAE;SGX&#x786C;&#x4EF6;&#x80FD;&#x529B;&#x7684;K8s&#x73AF;&#x5883;&#x4E2D;&#x521B;&#x5EFA;&#x5E76;&#x8BA4;&#x8BC1;&#x53EF;&#x4FE1;&#x7684;&#x96C6;&#x7FA4;&#x73AF;&#x5883;</li>
<li>&#x901A;&#x8FC7;&#x5BC6;&#x94A5;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF08;Key Management System, KMS&#xFF09;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x80FD;&#x529B;</li>
<li>&#x901A;&#x8FC7;&#x82F1;&#x7279;&#x5C14;&#xAE;SGX&#xFF0C;&#x52A0;&#x89E3;&#x5BC6;&#x6280;&#x672F;&#xFF0C;TLS&#xFF0C;&#x5B89;&#x5168;&#x8BA4;&#x8BC1;&#x7B49;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x5B89;&#x5168;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x548C;&#x6570;&#x636E;&#x901A;&#x4FE1;</li>
</ul>
<h3 id="&#x5E94;&#x7528;&#x6548;&#x679C;">&#x5E94;&#x7528;&#x6548;&#x679C;</h3>
<p>1&#x3001;BigDL PPML &#x7AEF;&#x5230;&#x7AEF;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7EE7;&#x627F;&#x4E86;&#x53EF;&#x4FE1;&#x6267;&#x884C;&#x73AF;&#x5883; (TEE) &#x7684;&#x4F18;&#x70B9;&#x3002;&#x548C;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x5B89;&#x5168;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x7684;&#x5B89;&#x5168;&#x6027;&#x548C;&#x6570;&#x636E;&#x6548;&#x7528;&#x6027;&#x5341;&#x5206;&#x7A81;&#x51FA;&#xFF0C;&#x540C;&#x65F6;&#x6027;&#x80FD;&#x635F;&#x8017;&#x8F83;&#x4F4E;&#x3002;</p>
<p>2&#x3001;&#x76F8;&#x6BD4;&#x666E;&#x901A;&#x5927;&#x6570;&#x636E;&#x5206;&#x6790;&#x5DE5;&#x4F5C;&#x6D41;&#xFF0C;BigDL PPML&#x9884;&#x5236;&#x4E86;&#x53EF;&#x4FE1;&#x5B89;&#x5168;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x3002;BigDL PPML&#x5DE5;&#x4F5C;&#x6D41;&#x5305;&#x62EC;&#x4E86;&#xFF1A;&#x57FA;&#x4E8E; SGX &#x7684;&#x53EF;&#x4FE1;&#x8BA1;&#x7B97;&#x6838;&#x5FC3;&#x7EC4;&#x4EF6;&#xFF0C;&#x652F;&#x6301; Apache Spark&#xFF0C; Spark SQL &#x4EE5;&#x53CA;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B49;&#x5E94;&#x7528;&#xFF1B;&#x7ECF;&#x8FC7;&#x62BD;&#x8C61;&#x7684;&#x8BA4;&#x8BC1;&#x670D;&#x52A1;&#x5BA2;&#x6237;&#x7AEF; API&#xFF1B;&#x7ECF;&#x8FC7;&#x62BD;&#x8C61;&#x7684;&#x5BC6;&#x94A5;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#x5BA2;&#x6237;&#x7AEF; API&#xFF1B;&#x52A0;&#x5BC6;&#x7684;&#x6570;&#x636E;&#x4F20; &#x8F93;&#x548C;&#x5B58;&#x50A8;&#xFF1B;&#x4EE5;&#x53CA;&#x5B9A;&#x5236;&#x7684; K8s &#x5BB9;&#x5668;&#x955C;&#x50CF;&#x3002;</p>
<p>3&#x3001;&#x4F7F;&#x7528;BigDL PPML&#x9884;&#x5236;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x4E13;&#x6CE8;&#x4E8E;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x76F8;&#x5173;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#xFF0C;&#x5229;&#x7528; BigDL PPML &#x4FDD;&#x969C;&#x5176;&#x5E94;&#x7528;&#x7684;&#x7AEF;&#x5230;&#x7AEF;&#x5B89;&#x5168;&#x6027;&#x548C;&#x9690;&#x79C1;&#x6027;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x663E;&#x8457;&#x63D0;&#x9AD8;&#x9690;&#x79C1;&#x8BA1;&#x7B97;&#x5E94;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x6548;&#x7387;&#xFF0C;&#x5927;&#x5E45;&#x7F29;&#x77ED;&#x5B9E;&#x73B0;&#x9690;&#x79C1;&#x8BA1;&#x7B97;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x5F00;&#x53D1;&#x65F6;&#x95F4; (Time to solution)&#x3002;</p>
<p>4&#x3001;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x8BE5;&#x65B9;&#x6848;&#xFF0C;&#x4F01;&#x4E1A;&#x80FD;&#x591F;&#x6784;&#x5EFA;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5B89;&#x5168;&#x4FDD;&#x62A4;&#x6D41;&#x7A0B;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x8F93;&#x5165;&#x3001;&#x6570;&#x636E;&#x5206;&#x6790;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3001;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B49; AI&#x3001;&#x5927;&#x6570;&#x636E;&#x5E94;&#x7528;&#x7684;&#x591A;&#x4E2A;&#x9636;&#x6BB5;&#x5EFA;&#x7ACB;&#x5B89;&#x5168;&#x9632;&#x62A4;&#x80FD;&#x529B;&#xFF0C;&#x907F;&#x514D;&#x5B89;&#x5168;&#x5A01;&#x80C1;&#x4E58;&#x865A;&#x800C;&#x5165;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x8BE5;&#x65B9;&#x6848;&#x5B9E;&#x73B0;&#x4E86;&#x57FA;&#x4E8E;&#x786C;&#x4EF6;&#x5E95;&#x5C42;&#x7684;&#x4FDD;&#x62A4;&#xFF0C;&#x5177;&#x5907;&#x66F4;&#x9AD8;&#x7684;&#x6570;&#x636E;&#x4FDD;&#x62A4;&#x7B49;&#x7EA7;&#xFF0C;&#x80FD;&#x591F;&#x9632;&#x62A4;&#x4F20;&#x7EDF;&#x5B89;&#x5168;&#x65B9;&#x6848;&#x96BE;&#x4EE5;&#x62B5;&#x6297;&#x7684;&#x653B;&#x51FB;&#x5F62;&#x5F0F;&#xFF0C;&#x964D;&#x4F4E;&#x91CD;&#x8981;&#x6570;&#x636E;&#x6CC4;&#x9732;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<p>5&#x3001;&#x5728;&#x8BE5;&#x65B9;&#x6848;&#x7684;&#x652F;&#x6301;&#x4E0B;&#xFF0C;&#x4F01;&#x4E1A;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x5B89;&#x5168;&#x7684;&#x6570;&#x636E;&#x878D;&#x901A;&#x670D;&#x52A1;&#xFF0C;&#x8054;&#x5408;&#x5206;&#x6790;&#x3001;&#x8054;&#x5408;&#x8BAD;&#x7EC3;&#x3001;&#x8054;&#x5408;&#x9884;&#x6D4B;&#x7B49;&#x5E94;&#x7528;&#x4E0D;&#x900F;&#x9732;&#x539F;&#x59CB;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x5E94;&#x7528;&#x903B;&#x8F91;&#x5C42;&#x9762;&#x7684;&#x6388;&#x6743;&#xFF0C;&#x4FDD;&#x8BC1;&#x573A;&#x666F;&#x5316;&#x7684;&#x6570;&#x636E;&#x878D;&#x901A;&#x5B89;&#x5168;&#x9700;&#x8981;&#xFF1B;&#x6EE1;&#x8DB3;&#x5546;&#x4E1A;&#x7684;&#x81EA;&#x4E3B;&#x6027;&#x3001;&#x53EF;&#x63A7;&#x6027;&#x3001;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4E3A;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x900F;&#x660E;&#x53EF;&#x63A7;&#x7684;&#x5B89;&#x5168;&#x6D41;&#x901A;&#x73AF;&#x5883;&#xFF0C;&#x53EF;&#x968F;&#x65F6;&#x7BA1;&#x63A7;&#x548C;&#x9000;&#x51FA;&#xFF0C;&#x6C38;&#x4FDD;&#x6570;&#x636E;&#x63A7;&#x5236;&#x6743;&#x3002;</p>
<h3 id="&#x7528;&#x6237;&#x60C5;&#x51B5;">&#x7528;&#x6237;&#x60C5;&#x51B5;</h3>
<ul>
<li><p>&#x8682;&#x8681;&#x96C6;&#x56E2;&#x5B89;&#x5168;&#x56E2;&#x961F;&#x9002;&#x914D;&#x4E86;BigDL PPML, &#x4E3A;&#x96C6;&#x56E2;&#x4E1A;&#x52A1;&#x63D0;&#x4F9B;&#x9690;&#x79C1;&#x5927;&#x6570;&#x636E;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
</li>
<li><p>&#x5176;&#x4ED6;&#x7528;&#x6237;&#x5305;&#x62EC;&#x706B;&#x5C71;&#x5F15;&#x64CE;&#xFF0C;&#x817E;&#x8BAF;&#x7B49;&#x3002;</p>
</li>
</ul>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; CNCC-sig.cn 2023 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2023-02-08 18:39:32
</span></footer>


<pre><code class="lang-html">&#x4F5C;&#x8005;: CNCC-sig
&#x94FE;&#x63A5;: https://https://github.com/inclavare-containers/cncc-sig-white-paper/ppml.html
&#x6765;&#x6E90;: CNCC-sig
&#x672C;&#x6587;&#x539F;&#x521B;&#x53D1;&#x5E03;&#x4E8E;&#x300C;CNCC-sig&#x300D;,&#x8F6C;&#x8F7D;&#x8BF7;&#x6CE8;&#x660E;&#x51FA;&#x5904;,&#x8C22;&#x8C22;&#x5408;&#x4F5C;!
</code></pre>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="java_enclave.html" class="navigation navigation-prev " aria-label="Previous page: JavaEnclave">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="cczoo.html" class="navigation navigation-next " aria-label="Next page: CCZoo">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"PPML","level":"1.3","depth":1,"next":{"title":"CCZoo","level":"1.4","depth":1,"path":"cczoo.md","ref":"./cczoo.md","articles":[]},"previous":{"title":"JavaEnclave","level":"1.2","depth":1,"path":"java_enclave.md","ref":"./java_enclave.md","articles":[]},"dir":"ltr"},"config":{"plugins":["alerts","tbfed-pagefooter","sectionx","expandable-chapters","chapter-fold","emphasize","chapter-fold","hide-element","tags","text-highlight","hints","copyright","-sharing","sharing-plus","edit-link"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy CNCC-sig.cn 2023","modify_label":"该文件修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"emphasize":{},"copyright":{"copyProtect":true,"site":"https://https://github.com/inclavare-containers/cncc-sig-white-paper/","author":"CNCC-sig","website":"CNCC-sig"},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"hints":{"danger":"fa fa-exclamation-circle","info":"fa fa-info-circle","tip":"fa fa-mortar-board","working":"fa fa-wrench"},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"sectionx":{"tag":"b"},"text-highlight":{},"highlight":{},"alerts":{},"tags":{"placement":"top"},"sharing":{"qq":false,"all":["weibo"],"douban":true,"facebook":false,"weibo":true,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":false,"messenger":false,"line":false,"vk":false,"pocket":false,"google":false,"viber":false,"stumbleupon":false,"qzone":true,"linkedin":false},"edit-link":{"label":"编辑","base":"https://github.com/inclavare-containers/cncc-sig-white-paper/edit/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","author":"CNCC-sig.cn","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"overview.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"CNCC-sig","language":"zh-hans","gitbook":">= 3.2.2","description":"CNCC-sig"},"file":{"path":"ppml.md","mtime":"2023-02-08T10:39:32.259Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-02-08T10:40:08.001Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-alerts/plugin.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-copyright/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

